book-collection/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "genre", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["author", ""], ["genre", "Action/Adventure"], ["date", "2020-09-19"], ["created_at", "2020-09-19 00:39:09.273127"], ["updated_at", "2020-09-19 00:39:09.273127"]]
---
  def create
    book = Book.create(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_book
    @book = Book.find(params[:id])